#A

#20 независими двойки, с 1/5 шанс за развитие на всяка.
# т.е. биномнос разпределени с N=20, p=0.2 ,
# търсим шанс повече от 8 от двойките да имат положителен резултат т.е 1 - P(x <=  8)

print(1 - pbinom(8, size = 20, prob = 0.2))



#B

# X~N(10000 , 1/5)
# Търси се P ( k < 2500 )

#средно -> n.p = 10000 * 1/5 = 2000
#Дисперсия n*p*(1-p) = 1600
# Стандартно отколенение sqrt(1600) = 40

# С очакване 2000 и  стандартно отклонение можем да кажем че е много верятно - практически почти сигурно случайте да са по 2500
print( pbinom(25000, size = 10000, prob = 0.2)) #R даже закръгля към 1

