  # A

group <- c("Younger (18-24)", "Middle (25-44)", "Older (45-64)")
x <- c(4.17, 4.04, 4.31)
s <- c(0.75, 0.81, 0.82)
n <- c(241, 768, 677)

z <- qnorm(0.975) #1.959964

low <- x - z * s / sqrt(n)
up  <- x + z * s / sqrt(n)

print(low)
print(up)

# С 95% довирителен интервал младите имат щастие между 4.075311 и 4.264689
# С 95% довирителен интервал средна възраст -> 3.982713 и 4.097287
# С 95% довирителен интервал възрастни -> 4.248231 и 4.248231



#B

#При един интервал има 5% вероятност да не създържа 'истинска' стойност
# При 3 независими -> 1 - (0.95^3) = 0.142625

print(1 - 0.95^3)

#C

# На база гледане предположението излгежда правилно
# upper-а на средна въздраст е по-малък от lower-a на възрастните, и почти същия като lowwer-a на младите