# Какво е класификация?
#Класификацията е метод в машинното самообучение, в което се категоризират данни в групи на база техните характеристики.


# Какво е бинарна класификация?
#Бинарната класификация е вид класификация, при която има само двe възможни изходни групи.


# Коя колона може да бъде целевата променлива за бинарна класификация?
# Колоната "churn" може да бъде целевата променлива за бинарна класификация, тъй като приема стойности 0 и 1, което предполага две възможни състояния.



# Какъв термин се използва за описание на останалите колони?
# Останалите колони се наричат "характеристики" или "фичъри" (features) и служат за предоставяне на информация, използвана за предсказване на целевата променлива.